Revit 2026 API

# ElectricalSystemNeutralConductorsNumber Property

---

The NeutralConductors Number of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int NeutralConductorsNumber { get; }
```
```vb
Public ReadOnly Property NeutralConductorsNumber As Integer
	Get
```
```cpp
public:
property int NeutralConductorsNumber {
	int get ();
}
```
```fsharp
member NeutralConductorsNumber : int with get
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the NeutralConductors Number of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace